aehoppe/E70N19_Dev_Board/atsame70n19/include/component/rtc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_VER_OFFSET                      (0x2C)                                        /**<  (RTC_VER) Valid Entry Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define RTC_VER_NVTIM_Pos                   0                                              /**< (RTC_VER) Non-valid Time Position */
#define RTC_VER_NVTIM_Msk                   (0x1U << RTC_VER_NVTIM_Pos)                    /**< (RTC_VER) Non-valid Time Mask */
#define RTC_VER_NVTIM                       RTC_VER_NVTIM_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_VER_NVTIM_Msk instead */
#define RTC_VER_NVCAL_Pos                   1                                              /**< (RTC_VER) Non-valid Calendar Position */
#define RTC_VER_NVCAL_Msk                   (0x1U << RTC_VER_NVCAL_Pos)                    /**< (RTC_VER) Non-valid Calendar Mask */
#define RTC_VER_NVCAL                       RTC_VER_NVCAL_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_VER_NVCAL_Msk instead */
#define RTC_VER_NVTIMALR_Pos                2                                              /**< (RTC_VER) Non-valid Time Alarm Position */
#define RTC_VER_NVTIMALR_Msk                (0x1U << RTC_VER_NVTIMALR_Pos)                 /**< (RTC_VER) Non-valid Time Alarm Mask */
#define RTC_VER_NVTIMALR                    RTC_VER_NVTIMALR_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_VER_NVTIMALR_Msk instead */
#define RTC_VER_NVCALALR_Pos                3                                              /**< (RTC_VER) Non-valid Calendar Alarm Position */
#define RTC_VER_NVCALALR_Msk                (0x1U << RTC_VER_NVCALALR_Pos)                 /**< (RTC_VER) Non-valid Calendar Alarm Mask */
#define RTC_VER_NVCALALR                    RTC_VER_NVCALALR_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_VER_NVCALALR_Msk instead */
#define RTC_VER_MASK                        (0x0FU)                                        /**< \deprecated (RTC_VER) Register MASK  (Use RTC_VER_Msk instead)  */
#define RTC_VER_Msk                         (0x0FU)                                        /**< (RTC_VER) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- RTC_WPMR : (RTC Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                  */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} RTC_WPMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_WPMR_OFFSET                     (0xE4)                                        /**<  (RTC_WPMR) Write Protection Mode Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define RTC_WPMR_WPEN_Pos                   0                                              /**< (RTC_WPMR) Write Protection Enable Position */
#define RTC_WPMR_WPEN_Msk                   (0x1U << RTC_WPMR_WPEN_Pos)                    /**< (RTC_WPMR) Write Protection Enable Mask */
#define RTC_WPMR_WPEN                       RTC_WPMR_WPEN_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_WPMR_WPEN_Msk instead */
#define RTC_WPMR_WPKEY_Pos                  8                                              /**< (RTC_WPMR) Write Protection Key Position */
#define RTC_WPMR_WPKEY_Msk                  (0xFFFFFFU << RTC_WPMR_WPKEY_Pos)              /**< (RTC_WPMR) Write Protection Key Mask */
#define RTC_WPMR_WPKEY(value)               (RTC_WPMR_WPKEY_Msk & ((value) << RTC_WPMR_WPKEY_Pos))
#define   RTC_WPMR_WPKEY_PASSWD_Val         (0x525443U)                                    /**< (RTC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define RTC_WPMR_WPKEY_PASSWD               (RTC_WPMR_WPKEY_PASSWD_Val << RTC_WPMR_WPKEY_Pos)  /**< (RTC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define RTC_WPMR_MASK                       (0xFFFFFF01U)                                  /**< \deprecated (RTC_WPMR) Register MASK  (Use RTC_WPMR_Msk instead)  */
#define RTC_WPMR_Msk                        (0xFFFFFF01U)                                  /**< (RTC_WPMR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief RTC hardware registers */
typedef struct {  
  __IO uint32_t RTC_CR;         /**< (RTC Offset: 0x00) Control Register */
  __IO uint32_t RTC_MR;         /**< (RTC Offset: 0x04) Mode Register */
  __IO uint32_t RTC_TIMR;       /**< (RTC Offset: 0x08) Time Register */
  __IO uint32_t RTC_CALR;       /**< (RTC Offset: 0x0C) Calendar Register */
  __IO uint32_t RTC_TIMALR;     /**< (RTC Offset: 0x10) Time Alarm Register */
  __IO uint32_t RTC_CALALR;     /**< (RTC Offset: 0x14) Calendar Alarm Register */
  __I  uint32_t RTC_SR;         /**< (RTC Offset: 0x18) Status Register */
  __O  uint32_t RTC_SCCR;       /**< (RTC Offset: 0x1C) Status Clear Command Register */
  __O  uint32_t RTC_IER;        /**< (RTC Offset: 0x20) Interrupt Enable Register */
  __O  uint32_t RTC_IDR;        /**< (RTC Offset: 0x24) Interrupt Disable Register */
  __I  uint32_t RTC_IMR;        /**< (RTC Offset: 0x28) Interrupt Mask Register */
  __I  uint32_t RTC_VER;        /**< (RTC Offset: 0x2C) Valid Entry Register */
  __I  uint32_t Reserved1[45];
  __IO uint32_t RTC_WPMR;       /**< (RTC Offset: 0xE4) Write Protection Mode Register */
} Rtc;

